Repository: 0xack13/regenerate-thumbnails
Catalog: localization/regenerate-thumbnails-*.po
Languages: es_pe, ja

source: Please don't clone RegenerateThumbnails
ja: RegenerateThumbnailsオブジェクトをcloneしないでください。

source: Please don't unserialize/wakeup RegenerateThumbnails
ja: RegenerateThumbnailsオブジェクトを復元できません。

source: Regenerate Thumbnails
es_pe: Regenerar miniaturas
ja: サムネイル再生成

source: Regen. Thumbnails
es_pe: Reg. miniaturas
ja: サムネイル再生成

source: Regenerate the thumbnails for this single image
es_pe: Regenerar miniaturas para esta imagen
ja: この画像のサムネイルを再生成

source: Cheatin&#8217; uh?
es_pe: ¿Haciendo trampa?
ja: 不正ですか?

source: Unable to find any images. Are you sure <a href='%s'>some exist</a>?
es_pe: No es posible encontrar ninguna imagen. ¿Estás seguro de que <a href='%s'>exista alguna</a>?
ja: 画像がありません。<a href='%s'>何か</a>あることを確認しましたか?

source: Please be patient while the thumbnails are regenerated. This can take a while if your server is slow (inexpensive hosting) or if you have many images. Do not navigate away from this page until this script is done or the thumbnails will not be resized. You will be notified via this page when the regenerating is completed.
es_pe: Por favor se paciente mientras las miniaturas son generadas. Esto puede tardar un poco si tu servidor es lento (hosting económicos, por ejemplo) o si tienes muchas imágenes. No navegues fuera de esta página hasta que el script finalice o las miniaturas no serán escaladas. Serás notificado en esta página cuando la regeneración sea completada.
ja: サムネイルが再生成されるまでしばらくおまちください。たくさん画像があったりサーバーが遅かったり(安いサーバーの場合)する場合時間がかかります。再生成が終わるまでこのページから離れないでください。サムネイルがリサイズされません。サムネイル再生成が終わるとこのページで通知されます。

source: To go back to the previous page, <a href="%s">click here</a>.
es_pe: Para regresar a la página anterior, <a href="%s">haga clic aquí</a>.
ja: 前のページへ戻るには、<a href="%s">ここをクリックしてください</a>。

source: All done! %1$s image(s) were successfully resized in %2$s seconds and there were %3$s failure(s). To try regenerating the failed images again, <a href="%4$s">click here</a>. %5$s
es_pe: ¡Todo listo! %1$s imagen(es) fueren satisfactoriamente escaladas en %2$s segundos y hubo %3$s falla(s). Para tratar de regenerar las miniaturas otra vez, <a href="%4$s">haga clic aquí</a>. %5$s
ja: 完了しました。%1$s枚の画像のリサイズを%2$s秒で完了しました。また、%3$s枚の画像のリサイズに失敗しました。失敗した画像の再生成をまた行うには、<a href="%4$s">ここをクリックしてください</a>。%5$s

source: Allows you to regenerate thumbnail images for times when you change thumbnail sizes or switch to a theme with a different featured image size.
ja: サムネイルのサイズを変更したり、画像のサイズが違うテーマに変更した時にサムネイルを再生成できます。

source: All done! %1$s image(s) were successfully resized in %2$s seconds and there were 0 failures. %3$s
es_pe: ¡Todo listo! %1$s imagen(es) fueron satisfactoriamente escaladas en %2$s segundos y hubo 0 falla(s). %3$s
ja: 完了しました。%1$s枚の画像のリサイズを%2$s秒で完了しました。また、%3$s枚の画像のリサイズに失敗しました。

source: You must enable Javascript in order to proceed!
es_pe: ¡Debes habilitar Javascript para proceder!
ja: 続行するにはJavaScriptを有効にしてください。

source: Abort Resizing Images
es_pe: Cancelar escalado de imágenes
ja: 画像のリサイズを中止

source: Debugging Information
es_pe: Información de depuración
ja: デバッグ情報

source: Total Images: %s
es_pe: Total de imágenes: %s
ja: 全画像数: %s

source: Images Resized: %s
es_pe: Imágenes escaladas: %s
ja: リサイズした画像数: %s

source: Resize Failures: %s
es_pe: Fallas al escalar: %s
ja: リサイズに失敗した画像数: %s

source: Stopping...
es_pe: Deteniendo...
ja: 停止中...

source: Use this tool to regenerate thumbnails for all images that you have uploaded to your site. This is useful if you've changed any of the thumbnail dimensions on the <a href='%s'>media settings page</a> or switched themes. Old thumbnails will be kept to avoid any broken images due to hard-coded URLs.
ja: このツールを使ってアップロードしたすべての画像のサムネイルを再生成できます。どれかのサムネイルの大きさを<a href='%s'>メディア設定</a>から変更した場合やテーマを変更した時に有用です。ハードコードされたURLの画像参照を破壊しないために古いサムネイルは残されます。

source: You can regenerate specific images (rather than all images) from the <a href='%s'>Media</a> page. Hover over an image's row and click the link to resize just that one image or use the checkboxes and the &quot;Bulk Actions&quot; dropdown to resize multiple images (WordPress 3.1+ only).
es_pe: Puedes regenerar imágenes específicas (en lugar de todas las imágenes) desde la página <a href='%s'>Medios</a>. Mantener el ratón sobre la fila de la imagen y hacer clic en el en enlace solo para esa imagen o usa las casillas y el desplegable &quot;Acciones en lote&quot; para escalar múltiples imágenes a la vez (WordPress 3.1+ solamente).
ja: 特定の画像だけ(すべての画像ではなく)を<a href='%s'>メディア</a>ページから再生成することもできます。画像の行にホバーしその画像のサムネイルを再生成するリンクをクリックしたり、チェックボックスを使って「一括操作」セレクトボックスから複数枚の画像の再生成も可能です(WordPress 3.1以上に限る)。

source: Thumbnail regeneration is not reversible, but you can just change your thumbnail dimensions back to the old values and click the button again if you don't like the results.
es_pe: La regeneración de las miniaturas no se puede revertir, pero puedes cambiar las dimensiones de la miniatura de regreso a sus valores antiguos y hacer clic en el botón otra vez si no te gustaron los resultados.
ja: サムネイル再生成は不可逆的ですが、気に入らなかった場合、サムネイルの大きさを元に戻した上でこのボタンをクリックすれば元に戻せます。

source: To begin, just press the button below.
es_pe: Para empezar, sólo presiona el botón de abajo.
ja: 始めるには、下のボタンをクリックしてください。

source: Regenerate All Thumbnails
es_pe: Regenerar todas las miniaturas
ja: すべてのサムネイルを再生成

source: Failed resize: %s is an invalid image ID.
es_pe: Escalado de imágenes fallido: %s es un ID de imagen invalido.
ja: リサイズ失敗: %sは無効な画像IDです。

source: Your user account doesn't have permission to resize images
es_pe: Tu cuenta de usuario no tiene permiso para escalar imágenes
ja: あなたのアカウントはリサイズする権限がありません

source: The originally uploaded image file cannot be found at %s
es_pe: El archivo de imagen originalmente subido no se encuentra en %s
ja: 元画像が%sにありません

source: Unknown failure reason.
es_pe: Razón del error desconocido.
ja: 失敗理由が不明です。

source: &quot;%1$s&quot; (ID %2$s) was successfully resized in %3$s seconds.
es_pe: "%1$s" (ID de %2$s) fue escalado con éxito en %3$s segundos.
ja: %1$s(ID %2$s)は%3$s秒で正常にリサイズされました。

source: &quot;%1$s&quot; (ID %2$s) failed to resize. The error message was: %3$s
es_pe: "%1$s" (ID de %2$s) error al cambiar el tamaño. El mensaje de error fue: %3$s
ja: %1$s(ID %2$s)のリサイズに失敗しました。エラーメッセージは以下の通りです: %3$s

source: Run
ja: 実行

source: The resize request was abnormally terminated (ID %s). This is likely due to the image exceeding available memory or some other type of fatal error.
es_pe: El escalado solicitado fue detenido anormalmente (ID %s). Esto se puede deber a que la imagen excede la memoria disponible o algún otro tipo de error fatal.

source: Use this tool to regenerate thumbnails for all images that you have uploaded to your blog. This is useful if you've changed any of the thumbnail dimensions on the <a href='%s'>media settings page</a>. Old thumbnails will be kept to avoid any broken images due to hard-coded URLs.
es_pe: Usa esta herramienta para regenerar miniaturas para todas las imágenes que hayas subido a tu blog. Esto es útil si has cambiado alguna de las dimensiones de las miniaturas en la página de <a href='%s'>configuración de medios</a>. Las miniaturas antiguas serán conservadas para evitar imágenes rotas debido a URLs escritas directamente en el código, por ejemplo.

source: Allows you to regenerate all thumbnails after changing the thumbnail sizes.
es_pe: Permite regenerar todas las miniaturas después de cambiar el tamaño de las miniaturas.
